#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 0s [id=850202893763]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.produto_credito_eventbridge will be created
  + resource "aws_cloudwatch_event_rule" "produto_credito_eventbridge" {
      + arn                 = (known after apply)
      + description         = "Agendamento para execução mensal do produto de crédito"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "produto_credito_eventbridge"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 14 5 * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.target_produto_credito will be created
  + resource "aws_cloudwatch_event_target" "target_produto_credito" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::850202893763:role/iamsr/RoleProducerDMA"
      + rule           = "produto_credito_eventbridge"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.log_state_machine_produto_credito will be created
  + resource "aws_cloudwatch_log_group" "log_state_machine_produto_credito" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "log_state_machine_produto_credito"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_sfn_state_machine.produto_credito_state_machine will be created
  + resource "aws_sfn_state_machine" "produto_credito_state_machine" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Execução sequencial de Glue Jobs"
              + StartAt = "Acionar Glue Job corp_produto_cartao_credito_sor"
              + States  = {
                  + "Acionar Glue Job corp_produto_cartao_credito_sor"  = {
                      + Next       = "Acionar Glue Job corp_produto_cartao_credito_sot"
                      + Parameters = {
                          + JobName = "corp_produto_cartao_credito_sor"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Acionar Glue Job corp_produto_cartao_credito_sot"  = {
                      + Next       = "Acionar Glue Job corp_produto_cartao_credito_spec"
                      + Parameters = {
                          + JobName = "corp_produto_cartao_credito_sot"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Acionar Glue Job corp_produto_cartao_credito_spec" = {
                      + End        = true
                      + Parameters = {
                          + JobName = "corp_produto_cartao_credito_spec"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "produto_credito_state_machine"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::850202893763:role/iamsr/RoleProducerDMA"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = (known after apply)
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rodolfoarmelim, Action: `pull_request`*